# Terminal
brew "zsh"
brew "tmux"

# Terminal utilities
brew "tree"
brew "vnstat"
brew "telnet"
brew "watch"
brew "grep"
brew "htop"
brew "ripgrep"
brew "rsync"
brew "the_silver_searcher"
brew "yq"
brew "jq"
brew "noti"
brew "fzf"
brew "fd"
brew "bat"
brew "git-delta"
brew "prettier"

# Git
brew "gh"
brew "git"

# Emacs
tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus@30"

# Python
brew "pyenv"
brew "python@3.11"
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"

# Languages
brew "node"
brew "bazelisk"
brew "buildifier"
brew "clang-format"
brew "go"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "terraform"
brew "tflint"
brew "llvm"

# Misc
brew "awscli"
brew "binwalk"
brew "findutils"
brew "coreutils"
brew "gnutls"
brew "gnupg"
brew "ffmpeg"
brew "imagemagick"
brew "openssh"
brew "pinentry-mac"
