# Terminal
brew "zsh"
brew "tmux"
cask "ghostty"

# Terminal utilities
brew "tree"
brew "vnstat"
brew "telnet"
brew "watch"
brew "grep"
brew "htop"
brew "ripgrep"
brew "rsync"
brew "the_silver_searcher"
brew "yq"
brew "jq"
brew "noti"
brew "fzf"
brew "fd"
brew "bat"
brew "riff"
brew "moor"
brew "prettier"
brew "mise"

tap "sourcegraph/src-cli"
brew "sourcegraph/src-cli/src-cli"

tap "teamookla/speedtest"
brew "teamookla/speedtest/speedtest"

# Git
brew "gh"
brew "git"

# Emacs
tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus@30"

# Agentic coding tools
cask "claude-code"
tap "anomalyco/tap"
brew "anomalyco/tap/opencode"
tap "steveyegge/beads"
brew "steveyegge/beads/bd"
cask "steipete/tap/codexbar"

# Python
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"

# Languages
brew "bazelisk"
brew "buildifier"
brew "clang-format"
brew "shellcheck"
brew "shfmt"
brew "terraform"
brew "tflint"
brew "llvm"

# Containers
brew "podman"

# Misc
brew "awscli"
brew "binwalk"
brew "findutils"
brew "coreutils"
brew "gnutls"
brew "gnupg"
brew "ffmpeg"
brew "imagemagick"
brew "openssh"
brew "pinentry-mac"
cask "utm"
